In [1]:
import numpy as np
import pandas as pd

In [5]:
dataset = pd.read_csv ("https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/nbaallelo.csv")

In [6]:
dataset.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [7]:
dataset.head(5)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [8]:
dataset.head(8)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN
5,3,194611020DTF,NBA,1,1947,11/2/1946,1,0,WSC,Capitols,...,43.135952,DTF,Falcons,33,1300.0000,1279.6189,A,W,0.359935,NaN
6,4,194611020PRO,NBA,1,1947,11/2/1946,1,0,BOS,Celtics,...,40.459381,PRO,Steamrollers,59,1300.0000,1305.1542,A,L,0.359935,NaN
7,4,194611020PRO,NBA,0,1947,11/2/1946,1,0,PRO,Steamrollers,...,41.540619,BOS,Celtics,53,1300.0000,1294.8458,H,W,0.640065,NaN

In [9]:
dataset.tail(8)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126306,63154,201506090CLE,NBA,1,2015,6/9/2015,100,1,GSW,Warriors,...,66.615417,CLE,Cavaliers,96,1716.8708,1723.4149,A,L,0.472157,NaN
126307,63154,201506090CLE,NBA,0,2015,6/9/2015,99,1,CLE,Cavaliers,...,61.826408,GSW,Warriors,91,1797.5032,1790.9591,H,W,0.527843,NaN
126308,63155,201506110CLE,NBA,1,2015,6/11/2015,101,1,GSW,Warriors,...,67.794983,CLE,Cavaliers,82,1723.4149,1704.3949,A,W,0.453428,NaN
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,...,60.309792,GSW,Warriors,103,1790.9591,1809.9791,H,L,0.546572,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,...,68.013329,CLE,Cavaliers,91,1704.3949,1700.7391,H,W,0.765565,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,...,60.010067,GSW,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,...,59.290245,GSW,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,...,68.519516,CLE,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN

In [10]:
len(dataset)

126314

In [11]:
dataset.shape

(126314, 23)

In [12]:
dataset.gameorder

0             1
1             1
2             2
3             2
4             3
          ...
126309    63155
126310    63156
126311    63156
126312    63157
126313    63157
Name: gameorder, Length: 126314, dtype: int64

In [16]:
dataset[['gameorder', 'game_id']]

        gameorder       game_id
0               1  194611010TRH
1               1  194611010TRH
2               2  194611020CHS
3               2  194611020CHS
4               3  194611020DTF
...           ...           ...
126309      63155  201506110CLE
126310      63156  201506140GSW
126311      63156  201506140GSW
126312      63157  201506170CLE
126313      63157  201506170CLE

[126314 rows x 2 columns]

In [18]:
dataset.iloc[0]

gameorder                   1
game_id          194611010TRH
lg_id                     NBA
_iscopy                     0
year_id                  1947
date_game           11/1/1946
seasongame                  1
is_playoffs                 0
team_id                   TRH
fran_id               Huskies
pts                        66
elo_i                    1300
elo_n                 1293.28
win_equiv             40.2948
opp_id                    NYK
opp_fran               Knicks
opp_pts                    68
opp_elo_i                1300
opp_elo_n             1306.72
game_location               H
game_result                 L
forecast             0.640065
notes                     NaN
Name: 0, dtype: object

In [19]:
dataset.iloc[1]

gameorder                   1
game_id          194611010TRH
lg_id                     NBA
_iscopy                     1
year_id                  1947
date_game           11/1/1946
seasongame                  1
is_playoffs                 0
team_id                   NYK
fran_id                Knicks
pts                        68
elo_i                    1300
elo_n                 1306.72
win_equiv             41.7052
opp_id                    TRH
opp_fran              Huskies
opp_pts                    66
opp_elo_i                1300
opp_elo_n             1293.28
game_location               A
game_result                 W
forecast             0.359935
notes                     NaN
Name: 1, dtype: object

In [21]:
dataset.iloc[99]

gameorder                  50
game_id          194611250PIT
lg_id                     NBA
_iscopy                     0
year_id                  1947
date_game          11/25/1946
seasongame                 10
is_playoffs                 0
team_id                   PIT
fran_id               Ironmen
pts                        46
elo_i                 1282.92
elo_n                 1264.89
win_equiv             37.3273
opp_id                    NYK
opp_fran               Knicks
opp_pts                    62
opp_elo_i             1309.93
opp_elo_n             1327.95
game_location               H
game_result                 L
forecast             0.603523
notes                     NaN
Name: 99, dtype: object

In [22]:
dataset.iloc[[99,100,101]]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
99,50,194611250PIT,NBA,0,1947,11/25/1946,10,0,PIT,Ironmen,...,37.327347,NYK,Knicks,62,1309.9252,1327.9469,H,L,0.603523,NaN
100,51,194611260DTF,NBA,0,1947,11/26/1946,11,0,DTF,Falcons,...,42.861538,CLR,Rebels,46,1311.4692,1300.3143,H,W,0.633588,NaN
101,51,194611260DTF,NBA,1,1947,11/26/1946,8,0,CLR,Rebels,...,41.032970,DTF,Falcons,66,1306.6039,1317.7588,A,L,0.366412,NaN

SERIES

In [23]:
dataset.iloc(1)

In [24]:
dataset.iloc[1]

gameorder                   1
game_id          194611010TRH
lg_id                     NBA
_iscopy                     1
year_id                  1947
date_game           11/1/1946
seasongame                  1
is_playoffs                 0
team_id                   NYK
fran_id                Knicks
pts                        68
elo_i                    1300
elo_n                 1306.72
win_equiv             41.7052
opp_id                    TRH
opp_fran              Huskies
opp_pts                    66
opp_elo_i                1300
opp_elo_n             1293.28
game_location               A
game_result                 W
forecast             0.359935
notes                     NaN
Name: 1, dtype: object

In [25]:
dataset.loc[1]

gameorder                   1
game_id          194611010TRH
lg_id                     NBA
_iscopy                     1
year_id                  1947
date_game           11/1/1946
seasongame                  1
is_playoffs                 0
team_id                   NYK
fran_id                Knicks
pts                        68
elo_i                    1300
elo_n                 1306.72
win_equiv             41.7052
opp_id                    TRH
opp_fran              Huskies
opp_pts                    66
opp_elo_i                1300
opp_elo_n             1293.28
game_location               A
game_result                 W
forecast             0.359935
notes                     NaN
Name: 1, dtype: object

In [29]:
dataset['team_id'].value_counts()

BOS    5997
NYK    5769
LAL    5078
DET    4985
PHI    4533
       ...
TRH      60
PIT      60
INJ      60
DTF      60
SDS      11
Name: team_id, Length: 104, dtype: int64

In [31]:
dataset.loc[dataset['team_id'] == 'MNL', 'date_game'].max()

'4/9/1959'

In [33]:
dataset.loc[dataset['team_id'] == 'MNL', 'date_game'].agg(('min','max'))

min    1/1/1949
max    4/9/1959
Name: date_game, dtype: object

In [35]:
revenues = pd.Series([5555,7000,1980])

In [36]:
revenues

0    5555
1    7000
2    1980
dtype: int64

In [37]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [41]:
a = pd.Series([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20])

In [42]:
a

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
dtype: int64

In [45]:
a.values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20], dtype=int64)

In [46]:
a.index

RangeIndex(start=0, stop=20, step=1)

In [48]:
index([a%2==0])

NameError: name 'index' is not defined

In [49]:
genap = np.arange(0,20,2)

In [50]:
deret_genap =pd.Series(genap)

In [51]:
deret_genap

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
9    18
dtype: int32

In [52]:
kota_ds = pd.DataFrame()

In [55]:
kota_ds = pd.DataFrame({
'kota' : ['jakarta','tangerang','depok'], 'populasi' : pd.Series([9,2,3]) })

In [56]:
kota_ds

        kota  populasi
0    jakarta         9
1  tangerang         2
2      depok         3

In [59]:
kota_ds.index(['a','b','c'])

TypeError: 'RangeIndex' object is not callable

In [60]:
kota_ds.keys()

Index(['kota', 'populasi'], dtype='object')

In [61]:
kota_ds = pd.DataFrame({
    
    "kota": ["jakarta", "bandung", "semarang"],
    "populasi" : pd.Series(([9, 2, 1]),
                index = ["a", "b", "c"])
    
})
kota_ds

       kota  populasi
a   jakarta         9
b   bandung         2
c  semarang         1

In [64]:
kota_ds[kota_ds['populasi'] < 9]

       kota  populasi
b   bandung         2
c  semarang         1

In [65]:
kota_ds['walikota'] = pd.Series(['susi','budi','joko'], index = ['a','b','c'])
kota_ds

       kota  populasi walikota
a   jakarta         9     susi
b   bandung         2     budi
c  semarang         1     joko

In [66]:
kota_ds.append({'kota':'manado','populasi':7,'walikota':'nila'},ignore_index = True)

       kota  populasi walikota
0   jakarta         9     susi
1   bandung         2     budi
2  semarang         1     joko
3    manado         7     nila

In [67]:
baris_manado = pd.Series({'kota':'manado','populasi':8,'walikota':'dado'},name='d')

In [69]:
baris_manado

kota        manado
populasi         8
walikota      dado
Name: d, dtype: object

In [71]:
kota_ds.append(baris_manado)

       kota  populasi walikota
a   jakarta         9     susi
b   bandung         2     budi
c  semarang         1     joko
d    manado         8     dado

In [72]:
kota_ds = kota_ds.append(baris_manado)

In [75]:
baris_surabaya= pd.Series({'kota':'surabaya', 'populasi':11, 'walikota':'baya'}, name='e')

In [76]:
baris_surabaya

kota        surabaya
populasi          11
walikota        baya
Name: e, dtype: object

kota_ds.append(baris_surabaya)

In [78]:
kota_ds = kota_ds.append(baris_surabaya)

In [79]:
kota_ds

       kota  populasi walikota
a   jakarta         9     susi
b   bandung         2     budi
c  semarang         1     joko
d    manado         8     dado
e  surabaya        11     baya

In [82]:
kota_ds.axes[0]

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [83]:
kota_ds.axes[1]

Index(['kota', 'populasi', 'walikota'], dtype='object')

In [84]:
c = pd.DataFrame({
    'a':[1,3,4],
    'b':[4,4,4],
    'c':[8,2,1]
})
c

   a  b  c
0  1  4  8
1  3  4  2
2  4  4  1

In [85]:
c.sum()

a     8
b    12
c    11
dtype: int64

In [86]:
c.sum(axis=1)

0    13
1     9
2     9
dtype: int64

In [88]:
c.sum(axis=0)

a     8
b    12
c    11
dtype: int64

In [90]:
kota_ds.iloc[1]

kota        bandung
populasi          2
walikota       budi
Name: b, dtype: object

In [91]:
kota_ds[kota_ds['kota']=='semarang']['walikota']

c    joko
Name: walikota, dtype: object

In [93]:
kota_ds[kota_ds['kota']=='manado']['walikota']

d    dado
Name: walikota, dtype: object

In [94]:
kota_ds

       kota  populasi walikota
a   jakarta         9     susi
b   bandung         2     budi
c  semarang         1     joko
d    manado         8     dado
e  surabaya        11     baya

In [98]:
kota_ds['jenis kelamin'] = pd.Series(['L','P','L','P','L'], ['a','b','c','d','e'])

In [99]:
kota_ds

       kota  populasi walikota jenis kelamin
a   jakarta         9     susi             L
b   bandung         2     budi             P
c  semarang         1     joko             L
d    manado         8     dado             P
e  surabaya        11     baya             L

In [100]:
kota_ds.groupby(['jenis kelamin'])['populasi'].sum()

jenis kelamin
L    21
P    10
Name: populasi, dtype: int64

In [101]:
kota_ds[kota_ds['kota'] !='manado']

       kota  populasi walikota jenis kelamin
a   jakarta         9     susi             L
b   bandung         2     budi             P
c  semarang         1     joko             L
e  surabaya        11     baya             L

In [103]:
kota_ds[kota_ds['kota'] !='manado'].groupby(['jenis kelamin'])['populasi'].count()

jenis kelamin
L    3
P    1
Name: populasi, dtype: int64

In [104]:
kota_ds.shape

(5, 4)

In [105]:
kota_ds.ndim

2

In [106]:
kota_ds.size

20

In [107]:
kota_ds['suhu'] = pd.Series([31,None,None,34,None],['a','b','c','d','e'])

In [108]:
kota_ds

       kota  populasi walikota jenis kelamin  suhu
a   jakarta         9     susi             L  31.0
b   bandung         2     budi             P   NaN
c  semarang         1     joko             L   NaN
d    manado         8     dado             P  34.0
e  surabaya        11     baya             L   NaN

In [109]:
kota_ds.dropna()

      kota  populasi walikota jenis kelamin  suhu
a  jakarta         9     susi             L  31.0
d   manado         8     dado             P  34.0

In [110]:
kota_ds.fillna(kota_ds['suhu'].mean())

       kota  populasi walikota jenis kelamin  suhu
a   jakarta         9     susi             L  31.0
b   bandung         2     budi             P  32.5
c  semarang         1     joko             L  32.5
d    manado         8     dado             P  34.0
e  surabaya        11     baya             L  32.5